

let A = [
  // 测试关卡 0
  [
    ["G"],
    ["R"],
    ["B"]
  ],
  // 正式关卡 1-10
  [
    ["R", "B"],
    ["G"],
    []
  ],
  [
    ["R"],
    ["G", "B"],
    []
  ],
  [
    ["R", "G"],
    ["B"],
    []
  ],
  [
    ["B"],
    ["G", "R"],
    []
  ],
  [
    ["G", "B"],
    [],
    ["R"]
  ],
  [
    [],
    ["G", "B"],
    ["R"]
  ],
  [
    ["R", "G", "B"],
    [],
    []
  ],
  [
    ["G", "B", "R"],
    [],
    []
  ],
  [
    ["B", "R"],
    ["G"],
    []
  ],
  [
    ["B"],
    ["G"],
    ["R"]
  ],
]

let PostOrder = [
  6, 1, 7, 2, 8, 3, 9, 4, 10, 5
]

PostOrder.forEach((stage) => {
  A.push(A[stage])
})

//__tol__.stages = A;



export default {
  A: A,
}
